Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The client then immediately sends the Finished message under the new algorithms, keys, and secrets.
zh_cn: 然后，客户端立即在新算法，密钥和机密下发送 Finished 消息。

source: The client uses the "signature_algorithms" extension to indicate to the server which signature/hash algorithm pairs may be used in digital signatures.
zh_cn: 客户端使用“signature_algorithms”扩展来向服务器指示可以在数字签名中使用哪些签名/散列算法对。

source: The client uses the PSK to authenticate the server and to encrypt the early data.
zh_cn: 客户端使用 PSK 对服务器进行身份验证并加密早期数据。

source: The client which initiates a request.
zh_cn: 发起请求的客户端。

source: The client will also send a ClientHello when the server has responded to its ClientHello with a HelloRetryRequest.
zh_cn: 当服务器使用 HelloRetryRequest 响应其 ClientHello 时，客户端也将发送 ClientHello。

source: The client will need to compute one for each potential PSK; if no PSK is selected, it will then need to compute the Early Secret corresponding to the zero PSK.
zh_cn: 客户端需要为每个潜在的 PSK 计算一个；如果没有选择 PSK，则需要计算对应于零 PSK 的早期密钥。

source: The client write parameters are used by the server when receiving and processing records and vice versa.
zh_cn: 客户端写入参数由服务器在接收和处理记录时使用，反之亦然。

source: The client's Diffie-Hellman public value (Yc).
zh_cn: 客户端的的 Diffie-Hellman 公开值(Yc)。

source: The close-delimiting feature exists primarily for backwards compatibility with HTTP/1.0.
zh_cn: close-delimiting 功能主要用于向后兼容 HTTP/1.0。

source: The code point groups listed above have the following meanings:
zh_cn: 上面列出的代码点组具有以下含义：

source: The combination of the ClientHello and the ServerHello determines the shared keys.
zh_cn: ClientHello 和 ServerHello 的组合确定共享密钥。

source: The comma (",") reserved character is often used for similar purposes.
zh_cn: 逗号(“,”)保留字符通常用于类似目的。

source: The complete URI syntax is collected in Appendix A.
zh_cn: 完整的 URI 语法收集在附录 A 中。

source: The complete list of status codes is maintained by IANA.
zh_cn: 完整的状态代码列表由 IANA 维护。

source: The complete set of tokens is defined by the IANA Character Set registry [19].
zh_cn: 完整的标记集由 IANA 字符集注册表 [19] 定义。

source: The components of the effective request URI, once determined as above, can be combined into absolute-URI form by concatenating the scheme, "://", authority, and combined path and query component.
zh_cn: 一旦如上确定，有效请求 URI 的组件可以通过连接方案“://”，权限以及组合 path 和 query 组件而组合成绝对 URI 形式。

source: The compressed form of TLSPlaintext.fragment.
zh_cn: TLSPlaintext.fragment 的压缩形式。

source: The compression algorithm is negotiated in the hello messages, and the random values are exchanged in the hello messages.
zh_cn: 压缩算法在 hello 消息中协商，随机值在 hello 消息中交换。

source: The compression algorithm translates a TLSPlaintext structure into a TLSCompressed structure.
zh_cn: 压缩算法将 TLSPlaintext 结构转换为 TLSCompressed 结构。

source: The computations for the Authentication messages all uniformly take the following inputs:
zh_cn: 所有身份验证消息的计算都统一采用以下输入：

source: The conditional GET method is intended to reduce unnecessary network usage by allowing cached entities to be refreshed without requiring multiple requests or transferring data already held by the client.
zh_cn: 条件 GET 方法旨在减少不必要的网络使用，通过允许刷新缓存的实体而不需要多个请求或传输客户端已经拥有的数据。

source: The connection options do not always correspond to a header field present in the message, since a connection-specific header field might not be needed if there are no parameters associated with a connection option.
zh_cn: 连接选项并不总是对应于消息中存在的首部字段，因为如果没有与连接选项关联的参数，则可能不需要特定于连接的首部字段。

source: The connection remains in the CLOSED state.
zh_cn: 连接仍处于 CLOSED 状态。

source: The connection remains in the same state.
zh_cn: 连接保持相同状态。

source: The content of the header beyond the End-of-Option option must be header padding (i.e., zero).
zh_cn: 超出选项结束选项的首部的内容必须是首部填充(即，零)。

source: The content that is covered under the signature is the hash output as described in Section 4.4.1, namely:
zh_cn: 签名中涵盖的内容是第 4.4.1 节中描述的哈希输出，即：

source: The contents and significance of each message will be presented in detail in the following sections.
zh_cn: 以下各节将详细介绍每条消息的内容和意义。

source: The contents of the inner struct (field3 and field4) are used as input for the signature/hash algorithm, and then the entire structure is encrypted with a stream cipher.
zh_cn: 内部结构(field3 和 field4)的内容用作签名/散列算法的输入，然后使用流密码加密整个结构。

source: The contents of this field are determined by the specified group and its corresponding definition.
zh_cn: 该字段的内容由指定的组及其相应的定义确定。

source: The contents themselves do not appear on the wire but are simply calculated.
zh_cn: 内容本身不会出现在线上，而只是简单计算。

source: The contents within a given field value are not parsed until a later stage of message interpretation (usually after the message's entire header section has been processed).
zh_cn: 直到消息解释的后期阶段(通常在处理消息的整个首部部分之后)，才解析给定字段值内的内容。

source: The context string for a client signature is "TLS 1.3, client CertificateVerify".
zh_cn: 客户端签名的上下文字符串是“TLS 1.3, client CertificateVerify”。

source: The context string for a server signature is "TLS 1.3, server CertificateVerify".
zh_cn: 服务器签名的上下文字符串是“TLS 1.3, server CertificateVerify”。

source: The corresponding response routing follows the same connection chain back to the client.
zh_cn: 相应的响应路由遵循相同的连接链返回客户端。

source: The cryptographic parameters of the session state are produced by the TLS Handshake Protocol, which operates on top of the TLS record layer.
zh_cn: 会话状态的加密参数由 TLS 握手协议产生，该协议在 TLS 记录层之上操作。

source: The cryptographic parameters used by the secure channel are produced by the TLS handshake protocol.
zh_cn: 安全通道使用的加密参数由 TLS 握手协议产生。

source: The current connection state is used for renegotiation messages.
zh_cn: 当前连接状态用于重新协商消息。

source: The current state of the compression algorithm.
zh_cn: 压缩算法的当前状态。

source: The current state of the encryption algorithm.
zh_cn: 加密算法的当前状态。

source: The current time and date in standard UNIX 32-bit format (seconds since the midnight starting Jan 1, 1970, UTC, ignoring leap seconds) according to the sender's internal clock.
zh_cn: 根据发送方的内部时钟，标准 UNIX 32 位格式的当前时间和日期(从 1970 年 1 月 1 日午夜开始，UTC，忽略闰秒)。

source: The data type of the representation data is determined via the header fields Content-Type and Content-Encoding.
zh_cn: 表示数据的数据类型通过首部字段 Content-Type 和 Content-Encoding 确定。

source: The dataflows in RxJava consist of a source, zero or more intermediate steps followed by a data consumer or combinator step (where the step is responsible to consume the dataflow by some means):
zh_cn: RxJava 中的数据流由源，零个或多个中间步骤，后跟数据消费者或组合器步骤(其中步骤负责通过某种方式消费数据流)组成：

source: The decompression function received improper input (e.g., data that would expand to excessive length).
zh_cn: 解压缩函数接收到不正确的输入(例如，将扩展到过长的数据)。

source: The decryption functions reverse the process.
zh_cn: 解密函数反转该过程。

source: The default (identity) encoding; the use of no transformation whatsoever.
zh_cn: 默认(标识)编码；没有任何转变的使用。

source: The default port is TCP 80 [19], but other ports can be used.
zh_cn: 默认端口是 TCP 80 [19]，但可以使用其他端口。

source: The definition of how they are used and compared as cache validators is in section 13.3.3.
zh_cn: 它们如何被使用和比较为缓存验证器的定义见第 13.3.3 节。

source: The definitions of "URI-reference", "absolute-URI", "relative-part", "scheme", "authority", "port", "host", "path-abempty", "segment", "query", and "fragment" are adopted from the URI generic syntax.
zh_cn: 从 URI 通用语法中采用 "URI-reference", "absolute-URI", "relative-part", "scheme", "authority", "port", "host", "path-abempty", "segment", "query" 和 "fragment" 的定义。

source: The delegated nature of registered names and IP addresses creates a federated namespace, based on control over the indicated host and port, whether or not an HTTP server is present.
zh_cn: 注册名称和 IP 地址的委派性质基于对指示的主机和端口的控制，无论是否存在 HTTP 服务器，都会创建联合命名空间。

source: The deprotection functions reverse the process.
zh_cn: 脱保护功能反转该过程。

source: The destination port number.
zh_cn: 目的端口号。

source: The differences between this protocol and SSL 3.0 are not dramatic, but they are significant enough that the various versions of TLS and SSL 3.0 do not interoperate (although each protocol incorporates a mechanism by which an implementation can back down to prior versions).
zh_cn: 此协议与 SSL 3.0 之间的差异并不明显 (dramatic)，但差异却非常显著 (significant)，以至于各种版本的 TLS 和 SSL 3.0 不能互操作(尽管每个协议都包含一种机制，通过该机制，实现可以退回到先前版本)。

source: The different labels prevent the substitution of one type of PSK for the other.
zh_cn: 不同的标签阻止了一种 PSK 替代另一种 PSK。

source: The digest used in the mask generation function and the digest being signed are both the corresponding hash algorithm as defined in [SHS].
zh_cn: 掩码生成函数中使用的摘要和被签名的摘要都是 [SHS] 中定义的相应散列算法。

source: The digital signature is then computed over the concatenation of:
zh_cn: 然后通过以下连接计算数字签名：

source: The documentation of each operator has a description about its backpressure behavior.
zh_cn: 每个操作符的文档都有关于其背压行为的描述。

source: The duplicate detection and sequencing algorithm in the TCP protocol relies on the unique binding of segment data to sequence space to the extent that sequence numbers will not cycle through all 2**32 values before the segment data bound to those sequence numbers has been delivered and acknowledged by the receiver and all duplicate copies of the segments have "drained" from the internet.
zh_cn: TCP 协议中的重复检测和排序算法依赖于报文段数据与序列空间的唯一绑定，以使序列号在绑定到那些序列号的报文段数据之前不会循环通过所有 2 ** 32 值并且接收方承认并且所有报文段的重复副本已从互联网“耗尽”。

source: The effect of a cache is that the request/response chain is shortened if one of the participants along the chain has a cached response applicable to that request.
zh_cn: 缓存的效果是，如果链中的一个参与者具有适用于该请求的缓存响应，则缩短请求/响应链。

source: The eight encoded pieces are given most-significant first, separated by colon characters.
zh_cn: 八个编码的片段首先被赋予最重要的，由冒号字符分隔。

source: The elements are separated by SP characters.
zh_cn: 元素由 SP 字符分隔。

source: The encoding format produced by the common UNIX file compression program "compress".
zh_cn: 通用 UNIX 文件压缩程序“compress”产生的编码格式。

source: The encoding used for Yc is determined by the enumerated PublicValueEncoding.
zh_cn: 用于 Yc 编码由所列举的 PublicValueEncoding 确定。

source: The encrypted data length (TLSCiphertext.length) is one more than the sum of SecurityParameters.block_length, TLSCompressed.length, SecurityParameters.mac_length, and padding_length.
zh_cn: 加密数据长度(TLSCiphertext.length)比 SecurityParameters.block_length，TLSCompressed.length，SecurityParameters.mac_length 和 padding_length 的总和多一。

source: The encrypted form of TLSCompressed.fragment, with the MAC.
zh_cn: 加密形式的 TLSCompressed.fragment，带 MAC。

source: The encrypted_record field of TLSCiphertext is set to AEADEncrypted.
zh_cn: TLSCiphertext 的 encrypted_record 字段设置为 AEADEncrypted。

source: The encryption and MAC functions translate a TLSCompressed structure into a TLSCiphertext.
zh_cn: 加密和 MAC 函数将 TLSCompressed 结构转换为 TLSCiphertext。

source: The end-of-line marker within an entity-body is defined by its associated media type, as described in section 3.7.
zh_cn: 实体主体中的行尾标记由其关联的媒体类型定义，如 3.7 节所述。

source: The entity-body (if any) sent with an HTTP request or response is in a format and encoding defined by the entity-header fields.
zh_cn: 使用 HTTP 发送的请求或响应实体主体(如果有)采用实体首部字段定义的格式和编码。

source: The entity-body is obtained from the message-body by decoding any Transfer-Encoding that might have been applied to ensure safe and proper transfer of the message.
zh_cn: 通过解码可能已经应用的确保安全和正确的消息传输的任何 Transfer-Encoding，从消息体获得实体主体。

source: The entity-length of a message is the length of the message-body before any transfer-codings have been applied.
zh_cn: 消息的实体长度是在应用任何传输编码之前消息体的长度。

source: The exact resource identified by an Internet request is determined by examining both the Request-URI and the Host header field.
zh_cn: 通过检查 Request-URI 和 Host 首部字段来确定 Internet 请求标识的确切资源。

source: The exception is still there but this time, the operator that can't signal more `onNext` will signal this exception instead (allowing better identification of who is not properly backpressured).
zh_cn: 例外情况仍然存在，但这一次，无法发出更多 `onNext` 信号的操作符将发出异常信号(允许更好地识别谁没有正确背压)。

source: The expectation to support HTTP/0.9 requests has been removed.
zh_cn: 已删除支持 HTTP/0.9 请求的期望。

source: The extension contains a list of supported versions in preference order, with the most preferred version first.
zh_cn: 该扩展包含优先顺序的受支持版本列表，首先是最优先的版本。

source: The extension format is:
zh_cn: 扩展格式为：

source: The extension-header mechanism allows additional entity-header fields to be defined without changing the protocol, but these fields cannot be assumed to be recognizable by the recipient.
zh_cn: 扩展首部机制允许在不更改协议的情况下定义其他实体首部字段，但不能假定这些字段可由接收者识别。

source: The field value MAY be preceded by any amount of LWS, though a single SP is preferred.
zh_cn: 字段值前面可以有任意数量的 LWS，但最好是只有单个 SP。

source: The field value does not include any leading or trailing whitespace: OWS occurring before the first non-whitespace octet of the field value or after the last non-whitespace octet of the field value ought to be excluded by parsers when extracting the field value from a header field.
zh_cn: 字段值不包括任何前导或尾随空格：在字段值的第一个非空白八位字节之前或在字段值的最后一个非空白八位字节之后出现的 OWS 应该在从首部字段中提取字段值时被解析器排除。

source: The field-content does not include any leading or trailing LWS: linear white space occurring before the first non-whitespace character of the field-value or after the last non-whitespace character of the field-value.
zh_cn: 字段内容不包括任何前导或尾随 LWS：线性空白区域出现在字段值的第一个非空白字符之前或字段值的最后一个非空白字符之后。

source: The field-name token labels the corresponding field-value as having the semantics defined by that header field.
zh_cn: 字段名标记将相应的字段值标记为具有由该首部字段定义的语义。

source: The fields within a structure may be qualified using the type's name, with a syntax much like that available for enumerateds.
zh_cn: 结构中的字段可以使用类型的名称进行限定，其语法与枚举可用的语法非常相似。

source: The figure above shows three intermediaries (A, B, and C) between the user agent and origin server.
zh_cn: 上图显示了用户代理和源服务器之间的三个中介(A，B 和 C)。

source: The figures should be interpreted in the following way.
zh_cn: 该图应按以下方式解释。

source: The final callback gets invoked when the downstream unsubscribes (closing the inputstream) or when the previous callback called the terminal methods; it allows freeing up resources.
zh_cn: 当下游取消​​订阅(关闭输入流)或前一个回调调用终端方法时，将调用最终的回调；它允许释放资源。

source: The final operator keeps only the latest value and practically overwrites older, undelivered values.
zh_cn: 最后一个操作符只保留最新的值，实际上覆盖了旧的、未传递的值。

source: The final recipient is either the origin server or the first proxy or gateway to receive a Max-Forwards value of zero (0) in the request (see section 14.31).
zh_cn: 最终接收者是原始服务器或第一个代理或网关，其在请求中接收 Max-Forwards 值为零(0)(请参阅第 14.31 节)。

source: The final recipient is either the origin server or the first server to receive a Max-Forwards value of zero (0) in the request (Section 5.1.2).
zh_cn: 最终接收者是源服务器或第一个在请求中接收 Max-Forwards 值为零(0)的服务器(第 5.1.2 节)。

source: The final recipient of the request SHOULD exclude any request header fields that are likely to contain sensitive data when that recipient generates the response body.
zh_cn: 请求的最终接收者应该排除在接收者生成响应正文时可能包含敏感数据的任何请求首部字段。

source: The final recipient of the request SHOULD reflect the message received back to the client as the entity-body of a 200 (OK) response.
zh_cn: 请求的最终接收者应该将收到的消息反映回客户端作为 200(OK)响应的实体主体。

source: The final recipient of the request SHOULD reflect the message received, excluding some fields described below, back to the client as the message body of a 200 (OK) response with a Content-Type of "message/http" (Section 8.3.1 of [RFC7230]).
zh_cn: 请求的最终接收者应将接收到的消息（不包括下面描述的某些字段）作为内容类型为“message/http”的 200（OK）响应的消息正文（见 [RFC7230] 第 8.3.1 节）反射回客户端。

source: The first callbacks allows one to create a per-subscriber state, such as the `FileInputStream` in the example; the file will be opened independently to each individual subscriber.
zh_cn: 第一个回调允许创建一个每个订阅者独立的状态，例如示例中的 `FileInputStream`;该文件将为每个订阅者独立打开。

source: The first data that a TLS server (and hence an HTTP/TLS server) expects to receive is the ClientHello.
zh_cn: TLS 服务器(以及 HTTP/TLS 服务器)期望接收的第一个数据是 ClientHello。

source: The first data that an HTTP server expects to receive from the client is the Request-Line production.
zh_cn: HTTP 服务器期望从客户端接收的第一个数据是请求行产品。

source: The first digit ("major version") indicates the HTTP messaging syntax, whereas the second digit ("minor version") indicates the highest minor version within that major version to which the sender is conformant and able to understand for future communication.
zh_cn: 第一个数字(“主要版本”)表示 HTTP 消息传递语法，而第二个数字(“次要版本”)表示该主要版本中的最高次要版本，发送者符合并且能够理解以用于将来的通信。

source: The first digit of the Status-Code defines the class of response.
zh_cn: Status-Code 的第一个数字定义了响应类型。

source: The first digit of the status-code defines the class of response.
zh_cn: 状态代码的第一个数字定义了响应类。

source: The first format is preferred as an Internet standard and represents a fixed-length subset of that defined by RFC 1123 [8] (an update to RFC 822 [9]).
zh_cn: 第一种格式是互联网标准的首选格式，它代表 RFC 1123 [8](RFC 822 [9] 的更新)定义的固定长度子集。

source: The first line of a Response message is the Status-Line, consisting of the protocol version followed by a numeric status code and its associated textual phrase, with each element separated by SP characters.
zh_cn: 响应消息的第一行是状态行(Status-Line)，由协议版本后跟数字状态代码及其关联的文本短语组成，每个元素由 SP 字符分隔。

source: The first line of a response message is the status-line, consisting of the protocol version, a space (SP), the status code, another space, a possibly empty textual phrase describing the status code, and ending with CRLF.
zh_cn: 响应消息的第一行是状态行，包括协议版本，空格(SP)，状态代码，另一个空格，可能为空的描述状态代码的文本短语，然后以 CRLF 结尾。

source: The first part of this test checks to see if the beginning of the segment falls in the window, the second part of the test checks to see if the end of the segment falls in the window; if the segment passes either part of the test it contains data in the window.
zh_cn: 该测试的第一部分检查该报文段的开头是否落入窗口，测试的第二部分检查该报文段的末端是否落入窗口；如果报文段通过测试的任何一部分，则它包含窗口中的数据。

source: The first side to send the ChangeCipherSpec does not know that the other side has finished computing the new keying material (e.g., if it has to perform a time-consuming public key operation).
zh_cn: 发送 ChangeCipherSpec 的第一方不知道另一方已经完成了对新密钥资料的计算(例如，如果它必须执行耗时的公钥操作)。

source: The first step is to include RxJava 2 into your project, for example, as a Gradle compile dependency:
zh_cn: 第一步是将 RxJava 2 包含到您的项目中，例如，作为 Gradle 编译依赖项：

source: The first typical case for its use when one wants to interact with a push-based source, such as GUI events.
zh_cn: 当人们想要与基于推的源（例如 GUI 事件）交互时使用的第一个典型案例。

source: The first version of HTTP, referred to as HTTP/0.9, was a simple protocol for raw data transfer across the Internet.
zh_cn: HTTP 的第一个版本，称为 HTTP/0.9，是一个简单的协议，用于通过 Internet 进行原始数据传输。

source: The five cryptographic operations -- digital signing, stream cipher encryption, block cipher encryption, authenticated encryption with additional data (AEAD) encryption, and public key encryption -- are designated digitally-signed, stream-ciphered, block-ciphered, aead-ciphered, and public-key-encrypted, respectively.
zh_cn: 五种加密操作 - 数字签名，流密码加密，分组密码加密，带有附加数据的加密认证(AEAD)加密和公钥加密 - 被分别指定为数字签名，流加密，分组加密，AEAD 加密和公钥加密。

source: The following are two example URIs and their component parts:
zh_cn: 以下是两个示例 URI 及其组成部分：

source: The following comparisons are needed to process the acknowledgments.
zh_cn: 处理确认需要进行以下比较。

source: The following considerations should be taken into account when designing new extensions:
zh_cn: 在设计新扩展时，应考虑以下注意事项：

source: The following core rules are included by reference, as defined in [RFC5234], Appendix B.1: ALPHA (letters), CR (carriage return), CRLF (CR LF), CTL (controls), DIGIT (decimal 0-9), DQUOTE (double quote), HEXDIG (hexadecimal 0-9/A-F/a-f), HTAB (horizontal tab), LF (line feed), OCTET (any 8-bit sequence of data), SP (space), and VCHAR (any visible [USASCII] character).
zh_cn: 以下核心规则通过引用包含在内，如 [RFC5234]，附录 B.1 中所定义的：ALPHA（字母），CR（回车），CRLF（CR LF），CTL（控制），DIGIT（十进制 0-9），DQUOTE（双引号），HEXDIG（十六进制 0-9/A-F/a-f），HTAB（水平制表符），LF（换行），OCTET（任何 8 位数据序列），SP（空格）和 VCHAR（任何可见的 [USASCII] 字符。

source: The following definition would cause one byte to be used to carry fields of type Color.
zh_cn: 以下定义将导致一个字节用于携带 Color 类型的字段。（译注：最大序数为 7，只需 1 个字节即可表示）

source: The following diagrams may help to relate some of these variables to the sequence space.
zh_cn: 以下图表可能有助于将这些变量中的一些与序列空间相关联。

source: The following error alerts are defined:
zh_cn: 定义了以下错误警报：

source: The following example URIs illustrate several URI schemes and variations in their common syntax components:
zh_cn: 以下示例 URI 说明了几种 URI 方案及其常见语法组件的变体：

source: The following example illustrates a typical message exchange for a GET request (Section 4.3.1 of [RFC7231]) on the URI
zh_cn: 以下示例说明了 URI 上 GET 请求([RFC7231] 的第 4.3.1 节)的典型消息交换

source: The following example illustrates a typical message exchange for a GET request (Section 4.3.1 of [RFC7231]) on the URI "http://www.example.com/hello.txt":
zh_cn: 以下示例说明 URI“http://www.example.com/hello.txt”上的 GET 请求([RFC7231] 的第 4.3.1 节)的典型消息交换：

source: The following example schedules someAction to be performed on someScheduler after 500ms have passed according to that Scheduler’s clock:
zh_cn: 以下示例根据调度器的时钟调度 500ms 后，在 someScheduler 上调度 someAction：

source: The following example schedules someAction to be performed on someScheduler after 500ms have passed, and then every 250ms thereafter:
zh_cn: 以下示例调度在经过 500ms 后在 someScheduler 上执行 someAction，然后每隔 250ms 执行一次：

source: The following example uses the schedule method of the Scheduler.Worker class to schedule work on the newThread Scheduler:
zh_cn: 以下示例使用Scheduler.Worker 类 的 schedule 方法 来安排 newThread 调度器：

source: The following external libraries can work with RxJava:
zh_cn: 以下外部库可以与 RxJava 一起使用：

source: The following header fields convey representation metadata:
zh_cn: 以下首部字段传达表示元数据：

source: The following illustrates the resulting chain if B has a cached copy of an earlier response from O (via C) for a request that has not been cached by UA or A.
zh_cn: 下面说明了当 B 具有来自 O(通过 C)的早期响应的缓存副本时的结果链，该响应是未被 UA 或 A 缓存的请求。

source: The following illustrates the resulting chain if B has a cached copy of an earlier response from O (via C) for a request which has not been cached by UA or A.
zh_cn: 下面说明了当 B 具有来自 O(通过 C)的早期响应的缓存副本时的结果链，该响应是未被 UA 或 A 缓存的请求。

source: The following is a hypothetical example sent by a client:
zh_cn: 以下是客户发送的假设示例：

source: The following is a list of the major functional differences between TLS 1.2 and TLS 1.3.
zh_cn: 以下是 TLS 1.2 和 TLS 1.3 之间主要功能差异的列表。

source: The following is an example response to the above hypothetical request:
zh_cn: 以下是对上述假设请求的示例响应：

source: The following matrix shows the available conversion options:
zh_cn: 以下矩阵显示了可用的转换选项：

source: The following numeric types are predefined.
zh_cn: 以下数字类型是预定义的。

source: The following rules apply to certificates sent by the client:
zh_cn: 以下规则适用于客户端发送的证书：

source: The following rules apply to the certificates sent by the server:
zh_cn: 以下规则适用于服务器发送的证书：

source: The following rules apply:
zh_cn: 以下规则适用：

source: The following rules are used throughout this specification to describe basic parsing constructs.
zh_cn: 在整个说明书中使用以下规则来描述基本的解析构造。

source: The following sections of this page will give marble diagrams that explain these operators schematically.
zh_cn: 本页的以下部分将给出 marble 图，可以示意性地解释这些操作符。

source: The following subsections list each base reactive type and the difference between 1.x and 2.x.
zh_cn: 以下小节列出了每个基本响应类型以及 1.x 和 2.x 之间的差异。

source: The following table defines the Handshake Context and MAC Base Key for each scenario:
zh_cn: 下表定义了每个方案的握手上下文和 MAC Base Key：

source: The following table shows the varieties of Scheduler that are available to you by means of these methods in RxGroovy:
zh_cn: 下表显示了在 RxGroovy 中通过这些方法可用的调度器的种类：

source: The following table shows the varieties of Scheduler that are available to you by means of these methods in RxJava:
zh_cn: 下表显示了在 RxJava 中通过这些方法可用的 Scheduler 的种类：

source: The following terms are used:
zh_cn: 使用以下术语：
